# Pivoting

Need 3 keys to use from your dataframe. The `index` & `columns` keys will be **zipped** together to form (x,y) pairs, then the `values` key is the function value associated to (x,y)

Things you need to make this happen:
- The `index` and the `columns` must for a set of unique pairs. They have to have the same number of unique values.

In [1]:
import pandas as pd

In [16]:
df = pd.DataFrame(data = {
    'col1': ['A', 'B', 'C', 'D'],
    'col2': [1,2,2,1],
    'col3': ['X', 'X', 'Y', 'Y'],
})

In [17]:
df

  col1  col2 col3
0    A     1    X
1    B     2    X
2    C     2    Y
3    D     1    Y

In [18]:
df.pivot(index = 'col3', columns = 'col2', values = 'col1')

col2  1  2
col3
X     A  B
Y     D  C

In [19]:
df.pivot(index = 'col2', columns = 'col3', values = 'col1')

col3  X  Y
col2
1     A  D
2     B  C

In [23]:
# An example that still has the same number of unique values in `index` and `columns`
# fields, but not every pair of those unique values has an associated `values` entry
df = pd.DataFrame(data = {
    'col1': ['A', 'B', 'C', 'D'],
    'col2': [1,2,3,4],
    'col3': ['X', 'Y', 'Z', 'A'],
})
print(df)
print("=========")
print(df.pivot(index = 'col3', columns = 'col2', values = 'col1'))

  col1  col2 col3
0    A     1    X
1    B     2    Y
2    C     3    Z
3    D     4    A
=========
col2    1    2    3    4
col3
A     NaN  NaN  NaN    D
X       A  NaN  NaN  NaN
Y     NaN    B  NaN  NaN
Z     NaN  NaN    C  NaN